//COBJOB    JOB     USER=ROOT,PASSWORD=SYS1
//JOBLIB    DD      DSN=SYS1.COBLIB,DISP=SHR
//STEP1     EXEC    PGM=COBOLAPP1
//HWDS      DD      DSN=HWDS,DISP=(NEW,CATLG,DELETE)
//SYSOUT    DD      SYSOUT=*  
